applications/solvers/icoDBSPermFoam/runs/splitcases60x50x100_2/subdomain0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//insert here
convertToMeters 2.5e-05;
Nx 60;
Ny 50;
Nz 50;


vertices        
(
    (0 0 0)
    ($Nx 0 0)
    ($Nx $Ny 0)
    (0 $Ny 0)
    (0 0 $Nz)
    ($Nx 0 $Nz)
    ($Nx $Ny $Nz)
    (0 $Ny $Nz)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) ($Nx $Ny $Nz) simpleGrading (1 1 1)
);

edges           
(
);

boundary         
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

    bottom
    {
        type wall;
        faces
        (  
            (1 5 4 0)
        );
    }

    frontAndBack
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs 
(
);

// ************************************************************************* //
